#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_default_route_table.rtb_public will be created
  + resource "aws_default_route_table" "rtb_public" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags                   = {
          + "Name" = "fiap-irango-rtb-public"
        }
      + tags_all               = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-rtb-public"
          + "Service"     = "fiap-irango"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_eip.default will be created
  + resource "aws_eip" "default" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "fiap-irango-elastic-ip"
        }
      + tags_all             = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-elastic-ip"
          + "Service"     = "fiap-irango"
        }
      + vpc                  = (known after apply)
    }

  # aws_internet_gateway.default will be created
  + resource "aws_internet_gateway" "default" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "fiap-irango-igw"
        }
      + tags_all = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-igw"
          + "Service"     = "fiap-irango"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.default will be created
  + resource "aws_nat_gateway" "default" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "fiap-irango-nat-gateway"
        }
      + tags_all                           = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-nat-gateway"
          + "Service"     = "fiap-irango"
        }
    }

  # aws_route_table.rtb_private_a will be created
  + resource "aws_route_table" "rtb_private_a" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "fiap-irango-rtb-private-a"
        }
      + tags_all         = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-rtb-private-a"
          + "Service"     = "fiap-irango"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.rtb_private_b will be created
  + resource "aws_route_table" "rtb_private_b" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "fiap-irango-rtb-private-b"
        }
      + tags_all         = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-rtb-private-b"
          + "Service"     = "fiap-irango"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.rtb_private_a will be created
  + resource "aws_route_table_association" "rtb_private_a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.rtb_private_b will be created
  + resource "aws_route_table_association" "rtb_private_b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.rtb_public_a will be created
  + resource "aws_route_table_association" "rtb_public_a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.rtb_public_b will be created
  + resource "aws_route_table_association" "rtb_public_b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.subnet_private_a will be created
  + resource "aws_subnet" "subnet_private_a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                              = "fiap-irango-subnet-private-a"
          + "kubernetes.io/cluster/fiap-irango" = "shared"
        }
      + tags_all                                       = {
          + "Environment"                       = "studying"
          + "Name"                              = "fiap-irango-subnet-private-a"
          + "Service"                           = "fiap-irango"
          + "kubernetes.io/cluster/fiap-irango" = "shared"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.subnet_private_b will be created
  + resource "aws_subnet" "subnet_private_b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                              = "fiap-irango-subnet-private-b"
          + "kubernetes.io/cluster/fiap-irango" = "shared"
        }
      + tags_all                                       = {
          + "Environment"                       = "studying"
          + "Name"                              = "fiap-irango-subnet-private-b"
          + "Service"                           = "fiap-irango"
          + "kubernetes.io/cluster/fiap-irango" = "shared"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.subnet_public_a will be created
  + resource "aws_subnet" "subnet_public_a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                              = "fiap-irango-subnet-public-a"
          + "kubernetes.io/cluster/fiap-irango" = "shared"
        }
      + tags_all                                       = {
          + "Environment"                       = "studying"
          + "Name"                              = "fiap-irango-subnet-public-a"
          + "Service"                           = "fiap-irango"
          + "kubernetes.io/cluster/fiap-irango" = "shared"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.subnet_public_b will be created
  + resource "aws_subnet" "subnet_public_b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                              = "fiap-irango-subnet-public-b"
          + "kubernetes.io/cluster/fiap-irango" = "shared"
        }
      + tags_all                                       = {
          + "Environment"                       = "studying"
          + "Name"                              = "fiap-irango-subnet-public-b"
          + "Service"                           = "fiap-irango"
          + "kubernetes.io/cluster/fiap-irango" = "shared"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.default will be created
  + resource "aws_vpc" "default" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"                              = "fiap-irango-vpc"
          + "kubernetes.io/cluster/fiap-irango" = "shared"
        }
      + tags_all                             = {
          + "Environment"                       = "studying"
          + "Name"                              = "fiap-irango-vpc"
          + "Service"                           = "fiap-irango"
          + "kubernetes.io/cluster/fiap-irango" = "shared"
        }
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + availability_zones  = [
      + "us-east-1a",
      + "us-east-1b",
    ]
  + aws_vpc_id          = (known after apply)
  + default_az          = "us-east-1a"
  + environment         = "studying"
  + region              = "us-east-1"
  + resource_prefix     = "fiap-irango"
  + subnet_private_a_id = (known after apply)
  + subnet_private_b_id = (known after apply)
  + subnet_public_a_id  = (known after apply)
  + subnet_public_b_id  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>